Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_reg.h
/** \\brief  F8, Port Access Enable Register 1 */
#define P02_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003A2F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P02_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003A250u)

/** \\brief  8, Port Identification Register */
#define P02_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003A208u)

/** \\brief  24, Port Input Register */
#define P02_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003A224u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P02_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003A210u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P02_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12 *)0xF003A21Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P02_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003A214u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P02_IOCR8  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8 *)0xF003A218u)

/** \\brief  94, Port Output Modification Clear Register */
#define P02_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003A294u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P02_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003A280u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P02_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12 *)0xF003A28Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P02_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003A284u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P02_OMCR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8 *)0xF003A288u)

/** \\brief  4, Port Output Modification Register */
#define P02_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003A204u)

/** \\brief  90, Port Output Modification Set Register */
#define P02_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003A290u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P02_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003A270u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P02_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12 *)0xF003A27Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P02_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003A274u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P02_OMSR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8 *)0xF003A278u)

/** \\brief  0, Port Output Register */
#define P02_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003A200u)

/** \\brief  64, Port Pin Controller Select Register */
#define P02_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003A264u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P02_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003A260u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P02_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003A240u)

/** \\brief  44, Port Pad Driver Mode Register 1 */
#define P02_PDR1   /*lint --e(923)*/ (*(volatile Ifx_P_PDR1 *)0xF003A244u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P10
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P10_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003AAFCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P10_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003AAF8u)

/** \\brief  50, Port Emergency Stop Register */
#define P10_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003AA50u)

/** \\brief  8, Port Identification Register */
#define P10_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003AA08u)

/** \\brief  24, Port Input Register */
#define P10_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003AA24u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P10_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003AA10u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P10_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12 *)0xF003AA1Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P10_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003AA14u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P10_IOCR8  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8 *)0xF003AA18u)

/** \\brief  94, Port Output Modification Clear Register */
#define P10_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003AA94u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P10_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003AA80u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P10_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12 *)0xF003AA8Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P10_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003AA84u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P10_OMCR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8 *)0xF003AA88u)

/** \\brief  4, Port Output Modification Register */
#define P10_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003AA04u)

/** \\brief  90, Port Output Modification Set Register */
#define P10_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003AA90u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P10_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003AA70u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P10_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12 *)0xF003AA7Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P10_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003AA74u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P10_OMSR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8 *)0xF003AA78u)

