Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_reg.h
/** \\brief  0, Port Output Register */
#define P10_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003AA00u)

/** \\brief  64, Port Pin Controller Select Register */
#define P10_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003AA64u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P10_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003AA60u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P10_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003AA40u)

/** \\brief  44, Port Pad Driver Mode Register 1 */
#define P10_PDR1   /*lint --e(923)*/ (*(volatile Ifx_P_PDR1 *)0xF003AA44u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P11
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P11_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003ABFCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P11_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003ABF8u)

/** \\brief  50, Port Emergency Stop Register */
#define P11_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003AB50u)

/** \\brief  8, Port Identification Register */
#define P11_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003AB08u)

/** \\brief  24, Port Input Register */
#define P11_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003AB24u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P11_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003AB10u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P11_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12 *)0xF003AB1Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P11_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003AB14u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P11_IOCR8  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8 *)0xF003AB18u)

/** \\brief  94, Port Output Modification Clear Register */
#define P11_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003AB94u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P11_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003AB80u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P11_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12 *)0xF003AB8Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P11_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003AB84u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P11_OMCR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8 *)0xF003AB88u)

/** \\brief  4, Port Output Modification Register */
#define P11_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003AB04u)

/** \\brief  90, Port Output Modification Set Register */
#define P11_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003AB90u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P11_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003AB70u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P11_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12 *)0xF003AB7Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P11_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003AB74u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P11_OMSR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8 *)0xF003AB78u)

/** \\brief  0, Port Output Register */
#define P11_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003AB00u)

/** \\brief  64, Port Pin Controller Select Register */
#define P11_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003AB64u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P11_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003AB60u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P11_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003AB40u)

/** \\brief  44, Port Pad Driver Mode Register 1 */
#define P11_PDR1   /*lint --e(923)*/ (*(volatile Ifx_P_PDR1 *)0xF003AB44u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P12
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P12_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003ACFCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P12_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003ACF8u)

/** \\brief  50, Port Emergency Stop Register */
#define P12_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003AC50u)

/** \\brief  8, Port Identification Register */
#define P12_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003AC08u)

/** \\brief  24, Port Input Register */
#define P12_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003AC24u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P12_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003AC10u)

/** \\brief  94, Port Output Modification Clear Register */
#define P12_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003AC94u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P12_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003AC80u)

/** \\brief  4, Port Output Modification Register */
#define P12_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003AC04u)

/** \\brief  90, Port Output Modification Set Register */
#define P12_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003AC90u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P12_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003AC70u)

/** \\brief  0, Port Output Register */
#define P12_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003AC00u)

/** \\brief  64, Port Pin Controller Select Register */
#define P12_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003AC64u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P12_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003AC60u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P12_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003AC40u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P13
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P13_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003ADFCu)

