Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_reg.h
/** \\brief  F8, Port Access Enable Register 1 */
#define P13_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003ADF8u)

/** \\brief  50, Port Emergency Stop Register */
#define P13_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003AD50u)

/** \\brief  8, Port Identification Register */
#define P13_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003AD08u)

/** \\brief  24, Port Input Register */
#define P13_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003AD24u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P13_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003AD10u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P13_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12 *)0xF003AD1Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P13_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003AD14u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P13_IOCR8  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8 *)0xF003AD18u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P13_LPCR0  /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0 *)0xF003ADA0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P13_LPCR1  /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1 *)0xF003ADA4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P13_LPCR2  /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2 *)0xF003ADA8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P13_LPCR3  /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3 *)0xF003ADACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P13_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003AD94u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P13_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003AD80u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P13_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12 *)0xF003AD8Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P13_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003AD84u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P13_OMCR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8 *)0xF003AD88u)

/** \\brief  4, Port Output Modification Register */
#define P13_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003AD04u)

/** \\brief  90, Port Output Modification Set Register */
#define P13_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003AD90u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P13_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003AD70u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P13_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12 *)0xF003AD7Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P13_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003AD74u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P13_OMSR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8 *)0xF003AD78u)

/** \\brief  0, Port Output Register */
#define P13_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003AD00u)

/** \\brief  64, Port Pin Controller Select Register */
#define P13_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003AD64u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P13_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003AD60u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P13_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003AD40u)

/** \\brief  44, Port Pad Driver Mode Register 1 */
#define P13_PDR1   /*lint --e(923)*/ (*(volatile Ifx_P_PDR1 *)0xF003AD44u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P14
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P14_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003AEFCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P14_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003AEF8u)

/** \\brief  50, Port Emergency Stop Register */
#define P14_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003AE50u)

/** \\brief  8, Port Identification Register */
#define P14_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003AE08u)

/** \\brief  24, Port Input Register */
#define P14_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003AE24u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P14_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003AE10u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P14_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12 *)0xF003AE1Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P14_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003AE14u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P14_IOCR8  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8 *)0xF003AE18u)

/** \\brief  B4, Port LVDS Pad Control Register 5 */
#define P14_LPCR5  /*lint --e(923)*/ (*(volatile Ifx_P_LPCR5 *)0xF003AEB4u)

/** \\brief  94, Port Output Modification Clear Register */
#define P14_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003AE94u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P14_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003AE80u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P14_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12 *)0xF003AE8Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P14_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003AE84u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P14_OMCR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8 *)0xF003AE88u)

/** \\brief  4, Port Output Modification Register */
#define P14_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003AE04u)

/** \\brief  90, Port Output Modification Set Register */
#define P14_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003AE90u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P14_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003AE70u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P14_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12 *)0xF003AE7Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P14_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003AE74u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P14_OMSR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8 *)0xF003AE78u)

