Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_reg.h
/** \\brief  0, Port Output Register */
#define P14_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003AE00u)

/** \\brief  64, Port Pin Controller Select Register */
#define P14_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003AE64u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P14_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003AE60u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P14_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003AE40u)

/** \\brief  44, Port Pad Driver Mode Register 1 */
#define P14_PDR1   /*lint --e(923)*/ (*(volatile Ifx_P_PDR1 *)0xF003AE44u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P15
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P15_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003AFFCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P15_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003AFF8u)

/** \\brief  50, Port Emergency Stop Register */
#define P15_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003AF50u)

/** \\brief  8, Port Identification Register */
#define P15_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003AF08u)

/** \\brief  24, Port Input Register */
#define P15_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003AF24u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P15_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003AF10u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P15_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12 *)0xF003AF1Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P15_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003AF14u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P15_IOCR8  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8 *)0xF003AF18u)

/** \\brief  B4, Port LVDS Pad Control Register 5 */
#define P15_LPCR5  /*lint --e(923)*/ (*(volatile Ifx_P_LPCR5 *)0xF003AFB4u)

/** \\brief  B8, Port LVDS Pad Control Register 6 */
#define P15_LPCR6  /*lint --e(923)*/ (*(volatile Ifx_P_LPCR6 *)0xF003AFB8u)

/** \\brief  94, Port Output Modification Clear Register */
#define P15_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003AF94u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P15_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003AF80u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P15_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12 *)0xF003AF8Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P15_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003AF84u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P15_OMCR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8 *)0xF003AF88u)

/** \\brief  4, Port Output Modification Register */
#define P15_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003AF04u)

/** \\brief  90, Port Output Modification Set Register */
#define P15_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003AF90u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P15_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003AF70u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P15_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12 *)0xF003AF7Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P15_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003AF74u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P15_OMSR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8 *)0xF003AF78u)

/** \\brief  0, Port Output Register */
#define P15_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003AF00u)

/** \\brief  64, Port Pin Controller Select Register */
#define P15_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003AF64u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P15_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003AF60u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P15_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003AF40u)

/** \\brief  44, Port Pad Driver Mode Register 1 */
#define P15_PDR1   /*lint --e(923)*/ (*(volatile Ifx_P_PDR1 *)0xF003AF44u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P20
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P20_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003B4FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P20_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003B4F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P20_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003B450u)

/** \\brief  8, Port Identification Register */
#define P20_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003B408u)

/** \\brief  24, Port Input Register */
#define P20_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003B424u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P20_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003B410u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P20_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12 *)0xF003B41Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P20_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003B414u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P20_IOCR8  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8 *)0xF003B418u)

/** \\brief  94, Port Output Modification Clear Register */
#define P20_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003B494u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P20_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003B480u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P20_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12 *)0xF003B48Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P20_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003B484u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P20_OMCR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8 *)0xF003B488u)

/** \\brief  4, Port Output Modification Register */
#define P20_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003B404u)

/** \\brief  90, Port Output Modification Set Register */
#define P20_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003B490u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P20_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003B470u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P20_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12 *)0xF003B47Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P20_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003B474u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P20_OMSR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8 *)0xF003B478u)

