Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_reg.h
/** \\brief  0, Port Output Register */
#define P20_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003B400u)

/** \\brief  64, Port Pin Controller Select Register */
#define P20_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003B464u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P20_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003B460u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P20_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003B440u)

/** \\brief  44, Port Pad Driver Mode Register 1 */
#define P20_PDR1   /*lint --e(923)*/ (*(volatile Ifx_P_PDR1 *)0xF003B444u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P21
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P21_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003B5FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P21_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003B5F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P21_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003B550u)

/** \\brief  8, Port Identification Register */
#define P21_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003B508u)

/** \\brief  24, Port Input Register */
#define P21_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003B524u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P21_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003B510u)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P21_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003B514u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P21_LPCR0  /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0 *)0xF003B5A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P21_LPCR1  /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1 *)0xF003B5A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P21_LPCR2  /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2 *)0xF003B5A8u)

/** \\brief  94, Port Output Modification Clear Register */
#define P21_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003B594u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P21_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003B580u)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P21_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003B584u)

/** \\brief  4, Port Output Modification Register */
#define P21_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003B504u)

/** \\brief  90, Port Output Modification Set Register */
#define P21_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003B590u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P21_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003B570u)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P21_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003B574u)

/** \\brief  0, Port Output Register */
#define P21_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003B500u)

/** \\brief  64, Port Pin Controller Select Register */
#define P21_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003B564u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P21_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003B560u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P21_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003B540u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P22
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P22_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003B6FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P22_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003B6F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P22_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003B650u)

/** \\brief  8, Port Identification Register */
#define P22_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003B608u)

/** \\brief  24, Port Input Register */
#define P22_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003B624u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P22_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003B610u)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P22_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003B614u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P22_IOCR8  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8 *)0xF003B618u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P22_LPCR0  /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0 *)0xF003B6A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P22_LPCR1  /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1 *)0xF003B6A4u)

/** \\brief  94, Port Output Modification Clear Register */
#define P22_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003B694u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P22_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003B680u)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P22_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003B684u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P22_OMCR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8 *)0xF003B688u)

/** \\brief  4, Port Output Modification Register */
#define P22_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003B604u)

/** \\brief  90, Port Output Modification Set Register */
#define P22_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003B690u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P22_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003B670u)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P22_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003B674u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P22_OMSR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8 *)0xF003B678u)

