Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_reg.h
/** \\brief  0, Port Output Register */
#define P22_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003B600u)

/** \\brief  64, Port Pin Controller Select Register */
#define P22_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003B664u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P22_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003B660u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P22_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003B640u)

/** \\brief  44, Port Pad Driver Mode Register 1 */
#define P22_PDR1   /*lint --e(923)*/ (*(volatile Ifx_P_PDR1 *)0xF003B644u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P23
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P23_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003B7FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P23_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003B7F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P23_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003B750u)

/** \\brief  8, Port Identification Register */
#define P23_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003B708u)

/** \\brief  24, Port Input Register */
#define P23_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003B724u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P23_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003B710u)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P23_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003B714u)

/** \\brief  94, Port Output Modification Clear Register */
#define P23_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003B794u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P23_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003B780u)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P23_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003B784u)

/** \\brief  4, Port Output Modification Register */
#define P23_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003B704u)

/** \\brief  90, Port Output Modification Set Register */
#define P23_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003B790u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P23_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003B770u)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P23_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003B774u)

/** \\brief  0, Port Output Register */
#define P23_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003B700u)

/** \\brief  64, Port Pin Controller Select Register */
#define P23_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003B764u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P23_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003B760u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P23_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003B740u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P24
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P24_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003B8FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P24_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003B8F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P24_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003B850u)

/** \\brief  8, Port Identification Register */
#define P24_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003B808u)

/** \\brief  24, Port Input Register */
#define P24_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003B824u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P24_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003B810u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P24_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12 *)0xF003B81Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P24_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003B814u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P24_IOCR8  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8 *)0xF003B818u)

/** \\brief  94, Port Output Modification Clear Register */
#define P24_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003B894u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P24_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003B880u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P24_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12 *)0xF003B88Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P24_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003B884u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P24_OMCR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8 *)0xF003B888u)

/** \\brief  4, Port Output Modification Register */
#define P24_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003B804u)

/** \\brief  90, Port Output Modification Set Register */
#define P24_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003B890u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P24_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003B870u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P24_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12 *)0xF003B87Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P24_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003B874u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P24_OMSR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8 *)0xF003B878u)

