Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_reg.h
/** \\brief  0, Port Output Register */
#define P24_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003B800u)

/** \\brief  64, Port Pin Controller Select Register */
#define P24_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003B864u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P24_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003B860u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P24_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003B840u)

/** \\brief  44, Port Pad Driver Mode Register 1 */
#define P24_PDR1   /*lint --e(923)*/ (*(volatile Ifx_P_PDR1 *)0xF003B844u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P25
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P25_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003B9FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P25_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003B9F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P25_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003B950u)

/** \\brief  8, Port Identification Register */
#define P25_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003B908u)

/** \\brief  24, Port Input Register */
#define P25_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003B924u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P25_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003B910u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P25_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12 *)0xF003B91Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P25_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003B914u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P25_IOCR8  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8 *)0xF003B918u)

/** \\brief  94, Port Output Modification Clear Register */
#define P25_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003B994u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P25_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003B980u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P25_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12 *)0xF003B98Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P25_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003B984u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P25_OMCR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8 *)0xF003B988u)

/** \\brief  4, Port Output Modification Register */
#define P25_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003B904u)

/** \\brief  90, Port Output Modification Set Register */
#define P25_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003B990u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P25_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003B970u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P25_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12 *)0xF003B97Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P25_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003B974u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P25_OMSR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8 *)0xF003B978u)

/** \\brief  0, Port Output Register */
#define P25_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003B900u)

/** \\brief  64, Port Pin Controller Select Register */
#define P25_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003B964u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P25_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003B960u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P25_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003B940u)

/** \\brief  44, Port Pad Driver Mode Register 1 */
#define P25_PDR1   /*lint --e(923)*/ (*(volatile Ifx_P_PDR1 *)0xF003B944u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P26
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P26_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003BAFCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P26_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003BAF8u)

/** \\brief  50, Port Emergency Stop Register */
#define P26_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003BA50u)

/** \\brief  8, Port Identification Register */
#define P26_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003BA08u)

/** \\brief  24, Port Input Register */
#define P26_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003BA24u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P26_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003BA10u)

/** \\brief  94, Port Output Modification Clear Register */
#define P26_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003BA94u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P26_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003BA80u)

/** \\brief  4, Port Output Modification Register */
#define P26_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003BA04u)

/** \\brief  90, Port Output Modification Set Register */
#define P26_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003BA90u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P26_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003BA70u)

/** \\brief  0, Port Output Register */
#define P26_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003BA00u)

/** \\brief  64, Port Pin Controller Select Register */
#define P26_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003BA64u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P26_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003BA60u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P26_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003BA40u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P30
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P30_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003BEFCu)

