Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_reg.h
/** \\brief  F8, Port Access Enable Register 1 */
#define P30_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003BEF8u)

/** \\brief  50, Port Emergency Stop Register */
#define P30_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003BE50u)

/** \\brief  8, Port Identification Register */
#define P30_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003BE08u)

/** \\brief  24, Port Input Register */
#define P30_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003BE24u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P30_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003BE10u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P30_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12 *)0xF003BE1Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P30_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003BE14u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P30_IOCR8  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8 *)0xF003BE18u)

/** \\brief  94, Port Output Modification Clear Register */
#define P30_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003BE94u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P30_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003BE80u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P30_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12 *)0xF003BE8Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P30_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003BE84u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P30_OMCR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8 *)0xF003BE88u)

/** \\brief  4, Port Output Modification Register */
#define P30_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003BE04u)

/** \\brief  90, Port Output Modification Set Register */
#define P30_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003BE90u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P30_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003BE70u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P30_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12 *)0xF003BE7Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P30_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003BE74u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P30_OMSR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8 *)0xF003BE78u)

/** \\brief  0, Port Output Register */
#define P30_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003BE00u)

/** \\brief  64, Port Pin Controller Select Register */
#define P30_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003BE64u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P30_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003BE60u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P30_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003BE40u)

/** \\brief  44, Port Pad Driver Mode Register 1 */
#define P30_PDR1   /*lint --e(923)*/ (*(volatile Ifx_P_PDR1 *)0xF003BE44u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P31
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P31_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003BFFCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P31_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003BFF8u)

/** \\brief  50, Port Emergency Stop Register */
#define P31_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003BF50u)

/** \\brief  8, Port Identification Register */
#define P31_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003BF08u)

/** \\brief  24, Port Input Register */
#define P31_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003BF24u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P31_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003BF10u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P31_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12 *)0xF003BF1Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P31_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003BF14u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P31_IOCR8  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8 *)0xF003BF18u)

/** \\brief  94, Port Output Modification Clear Register */
#define P31_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003BF94u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P31_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003BF80u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P31_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12 *)0xF003BF8Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P31_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003BF84u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P31_OMCR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8 *)0xF003BF88u)

/** \\brief  4, Port Output Modification Register */
#define P31_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003BF04u)

/** \\brief  90, Port Output Modification Set Register */
#define P31_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003BF90u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P31_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003BF70u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P31_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12 *)0xF003BF7Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P31_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003BF74u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P31_OMSR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8 *)0xF003BF78u)

