Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_reg.h
/** \\brief  0, Port Output Register */
#define P31_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003BF00u)

/** \\brief  64, Port Pin Controller Select Register */
#define P31_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003BF64u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P31_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003BF60u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P31_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003BF40u)

/** \\brief  44, Port Pad Driver Mode Register 1 */
#define P31_PDR1   /*lint --e(923)*/ (*(volatile Ifx_P_PDR1 *)0xF003BF44u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P32
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P32_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003C0FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P32_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003C0F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P32_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003C050u)

/** \\brief  8, Port Identification Register */
#define P32_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003C008u)

/** \\brief  24, Port Input Register */
#define P32_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003C024u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P32_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003C010u)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P32_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003C014u)

/** \\brief  94, Port Output Modification Clear Register */
#define P32_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003C094u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P32_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003C080u)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P32_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003C084u)

/** \\brief  4, Port Output Modification Register */
#define P32_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003C004u)

/** \\brief  90, Port Output Modification Set Register */
#define P32_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003C090u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P32_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003C070u)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P32_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003C074u)

/** \\brief  0, Port Output Register */
#define P32_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003C000u)

/** \\brief  64, Port Pin Controller Select Register */
#define P32_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003C064u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P32_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003C060u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P32_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003C040u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P33
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P33_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003C1FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P33_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003C1F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P33_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003C150u)

/** \\brief  8, Port Identification Register */
#define P33_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003C108u)

/** \\brief  24, Port Input Register */
#define P33_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003C124u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P33_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003C110u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P33_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12 *)0xF003C11Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P33_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003C114u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P33_IOCR8  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8 *)0xF003C118u)

/** \\brief  94, Port Output Modification Clear Register */
#define P33_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003C194u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P33_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003C180u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P33_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12 *)0xF003C18Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P33_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003C184u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P33_OMCR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8 *)0xF003C188u)

/** \\brief  4, Port Output Modification Register */
#define P33_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003C104u)

/** \\brief  90, Port Output Modification Set Register */
#define P33_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003C190u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P33_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003C170u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P33_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12 *)0xF003C17Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P33_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003C174u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P33_OMSR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8 *)0xF003C178u)

