Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_reg.h
/** \\brief  0, Port Output Register */
#define P33_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003C100u)

/** \\brief  64, Port Pin Controller Select Register */
#define P33_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003C164u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P33_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003C160u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P33_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003C140u)

/** \\brief  44, Port Pad Driver Mode Register 1 */
#define P33_PDR1   /*lint --e(923)*/ (*(volatile Ifx_P_PDR1 *)0xF003C144u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P34
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P34_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003C2FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P34_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003C2F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P34_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003C250u)

/** \\brief  8, Port Identification Register */
#define P34_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003C208u)

/** \\brief  24, Port Input Register */
#define P34_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003C224u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P34_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003C210u)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P34_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003C214u)

/** \\brief  94, Port Output Modification Clear Register */
#define P34_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003C294u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P34_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003C280u)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P34_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003C284u)

/** \\brief  4, Port Output Modification Register */
#define P34_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003C204u)

/** \\brief  90, Port Output Modification Set Register */
#define P34_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003C290u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P34_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003C270u)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P34_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003C274u)

/** \\brief  0, Port Output Register */
#define P34_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003C200u)

/** \\brief  64, Port Pin Controller Select Register */
#define P34_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003C264u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P34_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003C260u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P34_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003C240u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P40
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P40_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003C8FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P40_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003C8F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P40_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003C850u)

/** \\brief  8, Port Identification Register */
#define P40_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003C808u)

/** \\brief  24, Port Input Register */
#define P40_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003C824u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P40_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003C810u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P40_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12 *)0xF003C81Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P40_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003C814u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P40_IOCR8  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8 *)0xF003C818u)

/** \\brief  94, Port Output Modification Clear Register */
#define P40_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003C894u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P40_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003C880u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P40_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12 *)0xF003C88Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P40_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003C884u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P40_OMCR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8 *)0xF003C888u)

/** \\brief  4, Port Output Modification Register */
#define P40_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003C804u)

/** \\brief  90, Port Output Modification Set Register */
#define P40_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003C890u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P40_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003C870u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P40_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12 *)0xF003C87Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P40_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003C874u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P40_OMSR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8 *)0xF003C878u)

