Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPort_reg.h
/** \\brief  0, Port Output Register */
#define P40_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003C800u)

/** \\brief  64, Port Pin Controller Select Register */
#define P40_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003C864u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P40_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003C860u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P40_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003C840u)

/** \\brief  44, Port Pad Driver Mode Register 1 */
#define P40_PDR1   /*lint --e(923)*/ (*(volatile Ifx_P_PDR1 *)0xF003C844u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P41
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P41_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0 *)0xF003C9FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P41_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1 *)0xF003C9F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P41_ESR    /*lint --e(923)*/ (*(volatile Ifx_P_ESR *)0xF003C950u)

/** \\brief  8, Port Identification Register */
#define P41_ID     /*lint --e(923)*/ (*(volatile Ifx_P_ID *)0xF003C908u)

/** \\brief  24, Port Input Register */
#define P41_IN     /*lint --e(923)*/ (*(volatile Ifx_P_IN *)0xF003C924u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P41_IOCR0  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0 *)0xF003C910u)

#define P41_IOCR4  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4 *)0xF003C914u)
#define P41_IOCR8  /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8 *)0xF003C918u)
/** \\brief  94, Port Output Modification Clear Register */
#define P41_OMCR   /*lint --e(923)*/ (*(volatile Ifx_P_OMCR *)0xF003C994u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P41_OMCR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0 *)0xF003C980u)

#define P41_OMCR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4 *)0xF003C984u)
#define P41_OMCR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8 *)0xF003C988u)
/** \\brief  4, Port Output Modification Register */
#define P41_OMR    /*lint --e(923)*/ (*(volatile Ifx_P_OMR *)0xF003C904u)

/** \\brief  90, Port Output Modification Set Register */
#define P41_OMSR   /*lint --e(923)*/ (*(volatile Ifx_P_OMSR *)0xF003C990u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P41_OMSR0  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0 *)0xF003C970u)

#define P41_OMSR4  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4 *)0xF003C974u)
#define P41_OMSR8  /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8 *)0xF003C978u)
/** \\brief  0, Port Output Register */
#define P41_OUT    /*lint --e(923)*/ (*(volatile Ifx_P_OUT *)0xF003C900u)

/** \\brief  64, Port Pin Controller Select Register */
#define P41_PCSR   /*lint --e(923)*/ (*(volatile Ifx_P_PCSR *)0xF003C964u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P41_PDISC  /*lint --e(923)*/ (*(volatile Ifx_P_PDISC *)0xF003C960u)

/** \\brief  40, Port Pad Driver Mode Register 0 */
#define P41_PDR0   /*lint --e(923)*/ (*(volatile Ifx_P_PDR0 *)0xF003C940u)
#define P41_PDR1   /*lint --e(923)*/ (*(volatile Ifx_P_PDR1 *)0xF003C944u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPORT_REG_H */
